# HasRigidLinksWith Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..HasRigidLinksWith Method
AnalyticalModel Class See Also
---
Indicates if Analytical Model has Rigid Links with specified element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasRigidLinksWith(
	ElementId neighborId
)
```

Visual Basic
---
```text
Public Function HasRigidLinksWith ( _
	neighborId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool HasRigidLinksWith(
	ElementId^ neighborId
)
```

# ### Parameters
neighborId
    Type: Autodesk.Revit.DB..::..ElementId neighboring Element, to which Rigid Links may exist.
# ### Return Value
true if Rigid Links exist, false otherwise.
# Remarks
This is bidirectional, so this can be used to see if Rigid Links exist from Column to Beam.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace